test_cases/rhoCF_set1_alpha4_saiddes_ref1_z25/Allrun.local
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

# mesh creation with blockMesh
runApplication blockMesh
# decompose mesh
runApplication decomposePar
# distribute 0.orig directory to processor folders
restore0Dir -processor
# dummy file for post-processing
touch post.foam
# execute flow solver
runParallel rhoCentralFoam -parallel